<%--
  Created by IntelliJ IDEA.
  User: 86183
  Date: 2021/11/3
  Time: 0:04
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>需求</title>
</head>
<body>
    <h1>选课管理系统</h1>
    <label>
        主要实现以下功能：<br>
        （1）教师管理：课程设置申请模块，可以增加新的课程信息（课程号，课程名称、学分课时、课程简介等信息），删除旧的课程信息，修改已有的课程信息；课程管理模块，可以实现期末成绩的录入和学生名单的打印。<br>
        （2）教务处管理：包括课程设置审批模块和教学安排模块。课程设置审批模块可以根据申请内容通过审批或拒绝申请。教学安排模块分为，选课结果管理，成绩单（学号、学生姓名、课程名称、成绩等信息）生成，并能统计选课人数、最高成绩、最低成绩、平均成绩和及格人数。<br>
        （3）学生管理：包括选课模块、学生课程表模块和成绩查询模块（可以查询本课程的最高成绩、平均成绩、最低成绩和名次）。<br>
        （4）系统管理：使用该系统的人员除了教务管理人员，还包括教师和学生。不同的身份对数据库的操作权限不同。为了避免管理的混乱，需要针对不同的角色分别设计客户端应用程序，输入用户名和密码登陆系统后，进行相应的操作。<br>
    </label>
</body>
</html>
